{
  "0": "", 
  "1": "I remember when I first learned to program in that language. It's a hard language to learn I'm impressed that you used it!", 
  "2" : "That's a very interesting project! Reminds of some work I did back in college.",
  "3" : "Learning to lead can be very difficult. Your approach was smart.", 
  "4" : "Hmm I've never thought about leadership that way. Thanks for sharing that approach.",
  "5" : "Cool! Our company culture really emphasizes those aspects you highlighted as well.",
  "6" : "Working with others can be tough, but it's a skill you gain over time! I love working with my team now.",
  "7" :  "That's a really smart idea! Thanks for sharing that!",
  "8" :  "Working with others is a skill that we all have to work on! I am glad you were able to divide tasks equally.", 
  "9" :  "It is true that being in a virtual environment is different than an in-person one. Nonetheless, we can still be effective and motivated via different activities.", 
  "10" : "Choosing an environment that matched my values was my number one priority. I am glad you are also about it!", 
  "11" : "You are very brave for doing that! Thanks for sharing that.",
  "12" : "In my company, communication is vital!" , 
  "13" : "I remember when I was in college most of the projects that I worked on were required for my courses.", 
  "14" : "Everyone has different skill sets. I am glad you were able to utilize that!", 
  "15" : "I am glad you were able to divide tasks equally",
  "16" : "Exciting!!", 
  "17" :  "Cool!!", 
  "18" : "Very interesting!!", 
  "19" : "That's Awesome!!",
  "20" : "That must have been challenging.",
  "21" : "I am amazed by how well you were able to adapt!", 
  "22" : "I am impressed by your approach!", 
  "23" : "I like how you planned that!",
  "24" : "That is a great strategy!",
  "25" : "I like the methodology!",
  "26" : "I am glad you did not give up!", 
  "27" : "That must have been a transformative experience!", 
  "28" : "That must have been hard.", 
  "29" : "Maintaining your productivity and motivation is vital. I am glad you thought about that!", 
  "30" : "ok!"

}

